[
    {
        "Title": "Software and Services:",
        "Team": "Apps and Frameworks",
        "Job Category": "Software and Services",
        "Job Title": "Python Software Development Engineer - Apps Services",
        "Job Location": "Cupertino, California, United States",
        "Posted Date": "20240924",
        "Role Number": "200569639",
        "Summary": "Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. \n\nOur team runs the CI/CD pipeline for Apple's applications which supports thousands of developers around the globe. We are passionate about continuously improving the way we enable the software development lifecycle and push the envelope to reimagine cutting edge solutions to engineering problems of scale. As a member of the team, you would develop applications and micro-services to build and improve our next generation CI/CD pipeline.",
        "Description": "Develop and maintain CI/CD pipeline, services and integrations for Application development teams.\n\nCollaborate across teams to improve build, integration & release process.\n\nDevelop and maintain services and integrations for Apps Services CI/CD pipeline.\n\nMaintain and administrate dynamic Linux/macOS build farm.",
        "Key Qualifications": "B.S. in Computer Science or equivalent.\nProficient in Python programming.\nExperience with software development processes such as compilation, unit testing, code analysis, release process, and code coverage.\nExperience working on Linux and macOS based platforms.\nExperience with DevOps tools such as Ansible, Docker, Kubernetes.\nExperience with CI/CD process and platforms.\nAbility to participate in an after hours on-call rotation schedule.\nStrong analytical and problem solving skills.\nExcellent written and oral communication skills and ability to work with large development teams.",
        "Salario Mínimo": 143100,
        "Salario Máximo": 264200,
        "Job URL": "https://jobs.apple.com/en-us/details/200569639/python-software-development-engineer-apps-services?team=SFTWR"
    },
    {
        "Title": "Software and Services:",
        "Team": "Apps and Frameworks",
        "Job Category": "Software and Services",
        "Job Title": "Software Engineer, Enterprise Systems",
        "Job Location": "Austin, Texas, United States",
        "Posted Date": "20240924",
        "Role Number": "200534091",
        "Summary": "Apple is a place where extraordinary people gather to do their best work. Together we craft products and experiences people once couldn’t have imagined — and now can’t imagine living without. If you’re motivated by the idea of making a real impact, and joining a team where we pride ourselves in being one of the most diverse and inclusive companies in the world, a career with Apple might be your dream job!\n\nThe Customer Systems team is looking for an experienced Software Engineer. You will play a critical role in driving the strategy and execution, along with the technical direction for the Customer Systems team; working with business leaders and external vendors to define and establish system roadmap, design, develop, test and implement solution with high quality on time and within budget. Candidates should have software background with hands-on design and implementation experience of large-scale applications. Strong judgement, oral and written communication, and leadership skills are required. The ability of drive decisions through consensus and influence change and the ability to resolve conflict effectively is essential to succeed in this role!",
        "Description": "Responsible for deployment of large scale packaged cloud solution\n\nDefining solution architecture and integration across multiple Apple backend systems \n\nTroubleshooting application issues, code bugs, workflows and integrations\n\nCoordinating system performance tests\n\nMaintaining system security",
        "Key Qualifications": "Strong hands-on experience in Java/J2EE, developing and consuming REST services\nProfessional hands on experience in building and deploying scalable enterprise software solutions\nProfessional working experience in Customer Service Domain\nExperience in architecting and defining SaaS solutions\nUnderstanding of security concepts as applicable to package solution deployments",
        "Salario Mínimo": 0,
        "Salario Máximo": 0,
        "Job URL": "https://jobs.apple.com/en-us/details/200534091/software-engineer-enterprise-systems?team=SFTWR"
    },
    {
        "Title": "Software and Services:",
        "Team": "Apps and Frameworks",
        "Job Category": "Software and Services",
        "Job Title": "Senior Machine Learning Software Engineer",
        "Job Location": "Cupertino, California, United States",
        "Posted Date": "20240924",
        "Role Number": "200569815",
        "Summary": "Do you have a passion for building the best photo app experience in the world? iPhone is the most popular camera in the world! Seamless integration of software and hardware has delivered magnificent experiences like Photos Memories and Portrait Mode. The Camera & Photos team develops privacy-respecting machine learning technologies to ship Apple Intelligence features and emotional experiences to hundreds of millions of users worldwide. We are looking for an experienced Machine Learning Software Engineer to join our team to be part of this mission.",
        "Description": "In this role, you will be working on developing software that power Photos Apple Intelligence features on Apple platforms such as the iPhone, iPad, macOS, and the VisionPro. Candidates should have a proven track record that demonstrates innovation, strong collaboration, excellent interpersonal skills, and a passion for designing and developing high-quality software.",
        "Key Qualifications": "4+ years experience in developing and shipping production quality software\nC / C++ / Objective-C / Swift programming experience\nExperience in implementing Machine Learning, Deep Learning, and Knowledge Graph algorithms\nExceptional problem-solving and interpersonal skills",
        "Salario Mínimo": 143100,
        "Salario Máximo": 264200,
        "Job URL": "https://jobs.apple.com/en-us/details/200569815/senior-machine-learning-software-engineer?team=SFTWR"
    },
    {
        "Title": "Software and Services:",
        "Team": "Apps and Frameworks",
        "Job Category": "Software and Services",
        "Job Title": "Imaging and Software Quality Assurance Engineer, Photos",
        "Job Location": "Cupertino, California, United States",
        "Posted Date": "20240924",
        "Role Number": "200555603",
        "Summary": "At Apple you can be your best creative and professional self. In the Camera & Photos group, combining incredible hardware and fantastic software to make magic for millions is our purpose and passion - from capturing those special personal moments to preserving, enriching and sharing those memories to family and friends. To power this world-class experience it takes a dedicated team to ensure that quality never falls short of the Apple Promise. You can be one of those champions!\nThe Photos Quality Engineering team is offering a unique opportunity to join us in driving the quality growth for foundational imaging technologies and the features built upon on them as part of Apple's great photographic software. Take your career in quality engineering to the next level as part of an experienced and passionate cohort driving the full range of qualifications - from hands-on user experiences to lower-level data validations, on device and in the cloud.",
        "Description": "This individual contributor will engage with peers in development and quality to ensure imaging technology frameworks and the user-level features built on top of them are always functioning at the highest standard. Your responsibilities will focus on functional, regression and integration testing across our platforms, eg, macOS, tvOS, iOS and iPadOS. As part of a supportive team you will independently investigate, triage and escalate the problems you and others discover. Daily work focuses on iterative software validation, of existing and new features & technologies, using both manual and automated approaches. The demanding work environment requires balancing differing phases of multiple concurrent projects while delivering your important contributions to their success. Accountable for driving and triaging automation as needed including some script authoring. Excellent oral and written communication and organizational skills are needed due to the detailed and critical nature of the work as well as the extensive collaboration with others.",
        "Key Qualifications": "4+ years of professional experience in the lifecycles of consumer software test engineering, using both manual and automated methods, underpinned by a passion for delivering great products at high quality\nStrong analytical and problem-solving skills; experience in writing and running lengthy test plans; discovering and documenting software and hardware defects; prioritizing and escalating problems to peers and management, driving their resolution\nExcellent communication skills, both written and verbal; comfortable with distilling complex technical matters to concise and actionable tasks; working cross-functionally to everyone's benefit\nConfident and familiar with Apple’s current hardware and software ecosystem\nProfessional experience qualifying imaging correctness at the functional and framework level for user-facing features",
        "Salario Mínimo": 112900,
        "Salario Máximo": 234700,
        "Job URL": "https://jobs.apple.com/en-us/details/200555603/imaging-and-software-quality-assurance-engineer-photos?team=SFTWR"
    },
    {
        "Title": "Software and Services:",
        "Team": "Apps and Frameworks",
        "Job Category": "Software and Services",
        "Job Title": "Camera and Photos Software Engineer",
        "Job Location": "Cupertino, California, United States",
        "Posted Date": "20240924",
        "Role Number": "200564508",
        "Summary": "iPhone is the most popular camera in the world, and the Photos team builds a set of best-in-class features to highlight the amazing images that it can produce. The flawless integration of software and hardware has led to magical experiences in features like Cinematic HDR video, Portrait Mode and the new Clean up experience. The Photos team focuses on building new user experiences that also leverage computer vision and machine learning-based image processing. Our team works hard on products that ship to millions of people — we are looking for people who want to do the same!",
        "Description": "Come join the Photos team to do your best work on exciting and groundbreaking projects that will surprise and delight our users.\nApple’s Photos Edit team is looking for a talented, enthusiastic UI software engineer to join an expanding team focused on the next generation of image and video editing features in the Photos ecosystem.\nThese features touch the lives of millions of customers and we work closely with design, computer vision, and machine learning technologies to build something great.",
        "Key Qualifications": "Proven programming fundamentals and knowledge of object-oriented programming\nHave built projects using Objective-C or Swift and experience with iOS and macOS SDKs\nGood sense of UI design and a passion to focus on every detail, large and small\nExcels at solving and debugging hard problems",
        "Salario Mínimo": 143100,
        "Salario Máximo": 264200,
        "Job URL": "https://jobs.apple.com/en-us/details/200564508/camera-and-photos-software-engineer?team=SFTWR"
    },
    {
        "Title": "Software and Services:",
        "Team": "Apps and Frameworks",
        "Job Category": "Software and Services",
        "Job Title": "Product Manager - App Ads Signals, Ad Platforms",
        "Job Location": "Cupertino, California, United States",
        "Posted Date": "20240924",
        "Role Number": "200558563",
        "Summary": "At Apple, we work every day to create products that enrich people's lives. The App Store is a safe and trusted place to discover and download apps. We offer an innovative destination bring consumers amazing experiences that ensure the apps we offer are held to the highest standards for privacy, security, and content. \n\nOur technology makes advertising possible on the App Store, Apple News, Stocks, and Apple TV. We help developers and marketers of all sizes drive app discovery across the App Store. Our display ads on Apple News and Stocks let advertisers promote their products alongside trusted content in a brand-safe environment, while supporting publishers and journalists. Sponsorship integrations and experiences in live sports on Apple TV help advertisers connect with captivated audiences. Everything we do is with the unwavering commitment to privacy you expect from Apple. Because when advertising is done right, it benefits everyone.",
        "Description": "The Ad Platforms team builds privacy-first advertising products available globally, that delivers unparalleled experiences and value to consumers and app developers. We’re looking for a curious, analytical & collaborative technical Product Manager to form a deep understanding of Apple's privacy values and advertising objectives of app developers. Who can use those goals and values to inform their product strategy, and innovating on what powers Ad Platforms and our ML systems.\n\n-  Product owner for signals, features, and transforms that power our prediction, relevance & retrieval models, and machine learning systems. Produce the insights and intelligence that fuels Ad Platforms\n\n-  Define product features/enhancements and communicate requirements to engineering teams via clearly written requirements documents, diagrams, and concise verbal communication \n\n-  Work closely with engineers to enable them to identify the critical path, prioritize and deliver upon requirements \n\n-  Synthesize insights from research, customer meetings, platform engagement, and sales feedback to prioritize improvements and new feature ideas that'll deliver business goals and customer benefits \n\n-  Collaborate with partner product managers and go-to-market teams on the relevant feature delivery strategy and plans",
        "Key Qualifications": "3+ years of technical product management experience with at least one entire product development cycle from concept to launch\nExperience with Machine Learning systems and Prediction Modeling\nStrong technical and analytical abilities, including proficiency with SQL\nOutstanding written and verbal communication skills; ability to clearly articulate product's vision, product strategy and requirements to engineers and internal business partners\nExperience working closely with cross-functional teams and product stakeholders, to define and drive product strategy and roadmap\nAbility to build durable relationships, influence without authority, sell concepts internally, and actively drive decision-making across organizations\nSelf-motivated, thrives in a fast-paced environment with a high degree of ownership and accountability, and able to work efficiently to make continued progress on multiple priorities\nBachelors in Applied Mathematics, Economics, Computer or similar fields",
        "Salario Mínimo": 207800,
        "Salario Máximo": 312200,
        "Job URL": "https://jobs.apple.com/en-us/details/200558563/product-manager-app-ads-signals-ad-platforms?team=SFTWR"
    },
    {
        "Title": "Software and Services:",
        "Team": "Apps and Frameworks",
        "Job Category": "Software and Services",
        "Job Title": "Metal Game Ecosystem Engineer",
        "Job Location": "Austin, Texas, United States",
        "Posted Date": "20240924",
        "Role Number": "200567875",
        "Summary": "Apple's Metal Game Ecosystem team is looking for an engineer to join our team with a passion for performance and quality. You will work closely with 3rd party game and game engine developers as they optimize their renderers for Apple's unified gaming platform including Mac,\niPhone and iPad. You will be the technical voice of the game ecosystem back to Apple and help to inform future features and projects.",
        "Description": "GPU Software’s Metal Ecosystem team is looking for graphics software engineers to join us, working together with the world’s leading high end game and game engine developers. We represent the technical voice of the game developer ecosystem back into Apple and help provide input to the direction of future Apple products. We work hands on with game makers and 3rd party game engine developers. We work together with the GPU Software team and game developers to identify key features and optimizations. We help developers discover what’s possible. Are you ready to join us as we engineer the future of gaming on Metal? You will partner with external game and game engine developers to analyze their workloads and identify performance improvements, feature suggestions, memory usage, API usage and mentorship with clear agreed upon goals on how to improve the player experience. Collaborate in person or virtually with engineers in real time using Apple’s developer tools and deep knowledge of our architecture along with the developer’s knowledge of their application. Improve the developer and customer experience through engineering engagements on all Apple products with a GPU from iPhone to Mac. Define your goals and timeline to align with the external developers and work together to deliver. Act as the de facto specialist in Metal to the developer, including but not limited to providing informative workshops, direct contributions to source code, insight into actionable improvements and workflows. Regularly collaborate with internal teams outside of GPU Software to highlight opportunities with developers and drive improvements to the platform.",
        "Key Qualifications": "Working on rendering and graphics in games\nIn depth knowledge of modern computer graphics techniques including ray tracing\nIn depth knowledge of at least one modern graphics API (DirectX 12,\nVulkan, Metal, etc.)\nProficient in C/C++",
        "Salario Mínimo": 0,
        "Salario Máximo": 0,
        "Job URL": "https://jobs.apple.com/en-us/details/200567875/metal-game-ecosystem-engineer?team=SFTWR"
    },
    {
        "Title": "Software and Services:",
        "Team": "Apps and Frameworks",
        "Job Category": "Software and Services",
        "Job Title": "Metal Game Ecosystem Engineer",
        "Job Location": "Austin, Texas, United States",
        "Posted Date": "20240924",
        "Role Number": "200567747",
        "Summary": "Apple's Metal Game Ecosystem team is looking for an engineer to join our team with a passion for performance and quality. You will work closely with 3rd party game and game engine developers as they optimize their renderers for Apple's unified gaming platform including Mac,\niPhone and iPad. You will be the technical voice of the game ecosystem back to Apple and help to inform future features and projects.",
        "Description": "GPU Software’s Metal Ecosystem team is looking for graphics software engineers to join us, working together with the world’s leading high end game and game engine developers. We represent the technical voice of the game developer ecosystem back into Apple and help provide input to the direction of future Apple products. We work hands on with game makers and 3rd party game engine developers. We work together with the GPU Software team and game developers to identify key features and optimizations. We help developers discover what’s possible. Are you ready to join us as we engineer the future of gaming on Metal? You will partner with external game and game engine developers to analyze their workloads and identify performance improvements, feature suggestions, memory usage, API usage and mentorship with clear agreed upon goals on how to improve the player experience. Collaborate in person or virtually with engineers in real time using Apple’s developer tools and deep knowledge of our architecture along with the developer’s knowledge of their application. Improve the developer and user experience through engineering engagements on all Apple products with a GPU from iPhone to Mac. Define your goals and timeline to align with the external developers and work together to deliver. Act as the de facto specialist in Metal to the developer, including but not limited to providing informative workshops, direct contributions to source code, insight into actionable improvements and workflows. Regularly collaborate with internal teams outside of GPU Software to highlight opportunities with developers and drive improvements to the platform.",
        "Key Qualifications": "Working on rendering and graphics in games\nIn depth knowledge of modern computer graphics techniques including ray tracing\nIn depth knowledge of at least one modern graphics API (DirectX 12,\nVulkan, Metal, etc.)\nProficient in C/C++",
        "Salario Mínimo": 0,
        "Salario Máximo": 0,
        "Job URL": "https://jobs.apple.com/en-us/details/200567747/metal-game-ecosystem-engineer?team=SFTWR"
    },
    {
        "Title": "Software and Services:",
        "Team": "Apps and Frameworks",
        "Job Category": "Software and Services",
        "Job Title": "Senior Cloud Media Library Software Engineer",
        "Job Location": "Seattle, Washington, United States",
        "Posted Date": "20240924",
        "Role Number": "200569624",
        "Summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something.\n\nThis is a great opportunity to be an early member of a new engineering team on a highly visible, highly impactful project! You will be responsible for setting the direction and architecture of new and innovative on-device and cloud-based media management features for the creative space. You will work with human interface designers, quality assurance teams, and cross-functional engineering teams to go beyond code and influence everything from user interfaces to project planning.",
        "Description": "The Creativity Apps team is seeking a highly skilled Senior Engineer with in-depth knowledge and hands-on experience with on-device and cloud-based media management technologies. As a Senior Engineer you will play a key role in designing, implementing, and maintaining robust cloud syncing, media management, efficient on-device storage and collaboration solutions to enhance our products and services.",
        "Key Qualifications": "5+ years proven experience writing and shipping reliable, scalable, maintainable, and testable code\nExperience with Apple platforms including iOS and macOS\nProficient in Swift, Objective-C, C++, or C\nExperience as a technical lead; demonstrating strong communication, collaboration, and project management skills with the ability to articulate technical concepts to both technical and non-technical stakeholders\nProven expertise and deep understanding of cloud syncing, media management, and collaboration technologies\nSolid grasp of computer science fundamentals and object-oriented design\nAbility to write performant, scalable, maintainable, and correct multi-threaded code\nAbility to work effectively in a fast-paced environment and manage multiple priorities\nWillingness to ask for help, learn from others, and mentor others in turn\nCommitted to encouraging an open and inclusive work environment\nBachelor’s Degree in Computer Science or equivalent experience.",
        "Salario Mínimo": 166600,
        "Salario Máximo": 296300,
        "Job URL": "https://jobs.apple.com/en-us/details/200569624/senior-cloud-media-library-software-engineer?team=SFTWR"
    },
    {
        "Title": "Software and Services:",
        "Team": "Apps and Frameworks",
        "Job Category": "Software and Services",
        "Job Title": "Senior Product Designer (UI/UX)",
        "Job Location": "Austin, Texas, United States",
        "Posted Date": "20240923",
        "Role Number": "200562687",
        "Summary": "We are looking for an experienced Product Designer to craft usable, valuable, and delightful user experiences for key applications and tools that enable the manufacturing of every Apple product you know and love. Come join a passionate and skilled group of developers, designers, and product folks that care deeply about our users and the work they do",
        "Description": "You should have a passion for product design, UI, and UX; have a knack for digging deep into user problems to understand and empathize with an active and opinionated user base; and drive a team to simple and elegant solutions to hard, complex design problems.\n\nIn this role you will:\n- Conceive, design, and deliver user experiences and user flows, taking complex user actions and distilling them into usable interfaces\n- Collaborate with product managers to balance prioritization and break down features into iterative user stories\n- Collaborate with software developers to understand technical limitations and constraints and be able to iterate on solutions and craft viable and usable MVP-style features\n- Present and communicate lo-fi mockups, interaction design, hi-fi user flows, prototypes, and other design docs to the product team, stakeholder groups, and organizational leadership\n- Be able to clearly articulate design rationale and prioritize feedback to iterate rapidly as we learn more through the design exploration process\n- Be able to influence and gain alignment from others while being accountable for bringing critical thinking and product design strategy into all product design work\n- Ship experiences that are delightful to our users\n- Deeply understand and empathize with our users’ needs and painpoints",
        "Key Qualifications": "10+ years UI/UX experience in a software product team: prototyping, designing, and shipping full-stack software products\nExpertise designing across a diversity of platforms - web, mobile, responsive, AR/VR\nExpertise creating, owning, and evolving the information architecture (IA) of large complex applications\nExpertise in UI/UX wireframing and design tools, such as Sketch and Figma",
        "Salario Mínimo": 0,
        "Salario Máximo": 0,
        "Job URL": "https://jobs.apple.com/en-us/details/200562687/senior-product-designer-ui-ux?team=SFTWR"
    },
    {
        "Title": "Software and Services:",
        "Team": "Apps and Frameworks",
        "Job Category": "Software and Services",
        "Job Title": "Senior Full Stack Software Engineer",
        "Job Location": "Austin, Texas, United States",
        "Posted Date": "20240923",
        "Role Number": "200561634",
        "Summary": "Imagine what you could do here at Apple. Innovation runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it.\n\nThe people here at Apple don’t just build products — they craft the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. \n\nOur teams build the internal software applications used daily by the people who create the Apple products you know and love. Come join a passionate and skilled group of developers, designers, and product folks that care deeply about our users and the work they do.",
        "Description": "We’re looking for a Senior Fullstack Software Engineer with expertise in Node.js, React, Typescript, Javascript, and PostgreSQL. You will architect, develop and ship features with your cross-functional product and UX partners, as well as your fellow software engineers. You will also be expected to participate in the feature design process with our lean and talented team, drive new functionality, contribute to architectural and performance improvements, and overall bring your best every day to our team.\n\nUser engagement, feature ideas, roadmap planning, and technical discussions are very much a team sport in our organization, and we want you to come with opinions, best practices, and great ideas. \n\nIn this role you will:\n- Plan, develop, and ship new features alongside UX, product, and your fellow developers and designers, as well as users and stakeholders\n- Write maintainable & testable application code across the tech stack - from frontend, to API, to data layer - with great attention to detail, testing (unit and E2E), and documentation\n- Review code and collaborate on pull requests with your teammates\nIdentify and optimize performance bottlenecks that affect user workflows\n- Collaborate constantly with users, cross-functional teams, team members, leadership, and stakeholders to move projects along, gain clarity, and be able to ship the best possible experience and solution\n- Constantly learn and improve your own technical skills by reading code, documentation, running experiments and talking to your colleagues\n- Own features and solutions across the tech stack, from concept/RFC/ideation to shipping them to production, iterating, and maintaining them long-term\n- Hold yourself and your team members accountable to the high standards of design, quality, and execution that exist at Apple",
        "Key Qualifications": "10 years experience working on complex web applications across the entire stack with a skilled team, with expertise in Node.js and Typescript/Javascript\nExperience building robust HTTP APIs and backend services\nExperience building delightful and beautiful user experiences using React or other Javascript frontend frameworks",
        "Salario Mínimo": 0,
        "Salario Máximo": 0,
        "Job URL": "https://jobs.apple.com/en-us/details/200561634/senior-full-stack-software-engineer?team=SFTWR"
    },
    {
        "Title": "Software and Services:",
        "Team": "Apps and Frameworks",
        "Job Category": "Software and Services",
        "Job Title": "Senior DevOps Engineer",
        "Job Location": "Austin, Texas, United States",
        "Posted Date": "20240923",
        "Role Number": "200562684",
        "Summary": "Our teams build the internal software applications used daily by the people who create the Apple products you know and love. Come join a passionate and skilled group of developers, designers, and product folks that care deeply about our users and the work they do.",
        "Description": "We are looking for a Senior Engineer to work across our application stack (Rails, Node.js, React, Postgres, Jenkins, Elastic, Prometheus, Sentry, Docker, Golang, Ansible). \n\nIn this role you will:\n- Plan, lead, and do the work to migrate, manage and support onsite infrastructure within our on-prem and cloud environments\n- Support and advance development tools and technologies to reduce friction when shipping to production \n- Support the deployment of new features and applications by collaborating with fellow infra engineers, developers and designers, as well as users and stakeholders\n- Review code and collaborate on pull requests with your team members\n- Identify and optimize infrastructure performance bottlenecks that impact developer happiness and user workflows\n- Plan and upgrade our infrastructure and technology stacks to avoid technical debt\n- Support the troubleshooting, mitigation and fixing of production issues involving our Applications, Databases, Networks and Proxies using Grafana, Prometheus, Sentry, Kibana, WireShark and other monitoring and debugging tools\n- Constantly learn and improve your own technical skills by reading code, documentation, running experiments and collaborating with your colleagues",
        "Key Qualifications": "10+ years in a senior role working across the entire web stack with a skilled team\nExpertise in deploying applications using Ansible, Docker, and Jenkins\nExpertise using scripting languages such as bash\nDemonstrable experience deploying complex applications with SQL based database solutions (PostgreSQL, MySQL etc.) at medium scale\nExperience instrumenting, deploying and maintaining tools and stacks like ELK, Prometheus, Grafana, Jenkins, and/or Sentry",
        "Salario Mínimo": 0,
        "Salario Máximo": 0,
        "Job URL": "https://jobs.apple.com/en-us/details/200562684/senior-devops-engineer?team=SFTWR"
    },
    {
        "Title": "Software and Services:",
        "Team": "Apps and Frameworks",
        "Job Category": "Software and Services",
        "Job Title": "Sr. Software Engineer, AppleTV App",
        "Job Location": "San Diego, California, United States",
        "Posted Date": "20240923",
        "Role Number": "200566597",
        "Summary": "The Video engineering server team is looking for experienced software engineers to build highly scalable, low latency backend services and data systems for the Apple TV app.  This service platform is the backbone of the Apple TV app where it is supported, including iOS, tvOS, macOS, visionOS, Roku, Fire TV, and Samsung TV.  We handle millions of requests per day  from millions of end-users around the world to discover and consume Apple TV+ Originals, Live Sports broadcasts for MLS and MLB leagues, and the vast catalog of content from Apple partners.  This is the perfect opportunity for someone who wants to work with highly talented engineers on backend service platforms, data ingestion pipelines, data storage and retrieval systems.  If you are interested in the Video domain and is passionate about service reliability and latency optimization, this is the place to be.\n\nWe offer an environment where you are an integral part of an innovative, impactful team making a difference. Be ready to make something phenomenal when you come here. Multifaceted, inspiring people and innovative industry-defining technologies are the norm at Apple. The people who work here have reinvented and defined entire industries with our products and services. The same passion for innovation also applies to our business practices - strengthening our dedication to leave the world better than we found it. Join the team to build what’s next!",
        "Description": "You will be working on the video content catalog and discovery service platform that powers the Apple TV app.  This team tackles challenging and interesting problems ranging from service scalability and service runtime performance, to the creation/fine-tuning and inference of models for content discovery.  Design and implement services in Java.  Improve on our catalog data system built on Solr.  Perform data analysis using Spark and Scala.  The ideal candidate would also be comfortable with AI/ML concepts like embeddings, ANN, and integrating AI/ML models into a backend service.",
        "Key Qualifications": "5+ years related work experience\nExpertise in Solr, Lucene and/or Elastic Search required\nFluent in Java\nBuilt backend services for consumer product\nBuilt highly scalable micro-services",
        "Salario Mínimo": 135400,
        "Salario Máximo": 250600,
        "Job URL": "https://jobs.apple.com/en-us/details/200566597/sr-software-engineer-appletv-app?team=SFTWR"
    },
    {
        "Title": "Software and Services:",
        "Team": "Apps and Frameworks",
        "Job Category": "Software and Services",
        "Job Title": "UI/UX Frontend Software Engineer",
        "Job Location": "Seattle, Washington, United States",
        "Posted Date": "20240923",
        "Role Number": "200482088",
        "Summary": "Are you passionate about enabling compelling new experiences through software? Do you enjoy rapidly exploring and iterating on new, sometimes astonishing, ideas? The Intelligent System Experience Special Projects team explores and prototypes new, novel, and paradigm shifting ideas in system experience, computer vision, machine learning and natural language processing with emphasis on motivating future Apple products and features.\n\nWe are a new and growing team. This is an exciting time to join and have impact across our entire portfolio. We are especially looking for people who love to collaborate across subject areas and teams, and are motivated and inspired by the potential to help shape the future of system experiences across the entire Apple ecosystem.",
        "Description": "We are looking for a UI/UX front end software incubation engineer to create new features for current and future Apple platforms. This role will work at all stages of incubation including ideation, development, and experimentation to realize next-generation ideas. You will actively work across a diverse portfolio of projects, developing exploratory system experiences in concert with designers, software/hardware engineers, and applied R&D teams.",
        "Key Qualifications": "Bachelors in Computer Science, Computer/Electrical Engineering, or equivalent work experience.\n5+ years of professional software engineering experience\nProficiency in Objective-C and Swift (SwiftUI)\nAbility to work independently and collaborate across a multi-disciplinary team of engineers, researchers, and designers\nStrong written and verbal communication skills",
        "Salario Mínimo": 135400,
        "Salario Máximo": 250600,
        "Job URL": "https://jobs.apple.com/en-us/details/200482088/ui-ux-frontend-software-engineer?team=SFTWR"
    },
    {
        "Title": "Software and Services:",
        "Team": "Apps and Frameworks",
        "Job Category": "Software and Services",
        "Job Title": "Quality of Service Operations Engineer",
        "Job Location": "Cupertino, California, United States",
        "Posted Date": "20240921",
        "Role Number": "200569228",
        "Summary": "People at Apple don't just build products — we craft the kind of experiences which have revolutionized entire industries. Our diverse collection of people, and their ideas, inspire innovation in everything we do. Imagine what you could do here! Apple Services Engineering (ASE) builds and provides the systems and infrastructure that enable Apple's services at massive scale — such as iCloud, TV+, Music and App Store. We are the foundation on which Apple's software developers build the services our customers love. The ASE Quality of Service team are looking for a passionate and talented engineer to help deliver Apple customers the best quality of service for the App Store, Apple Music, Apple TV+ and more. Our services must scale globally, be highly available, performant, and simply \"just work\". If you love running, monitoring and improving systems that delight millions of customers, then this is the place for you.",
        "Description": "We are hiring an outstanding individual to join the ASE Quality of Service Operations team. Our engineers develop tools, monitoring solutions and operational processes to help Apple deliver the highest quality of media services to our customers. We are responsible for the software that drives real-time end-to-end quality of service and influences the performance of Apple’s vast service delivery architecture. We are looking for a standout colleague who is able to take on challenges under tight deadline constraints and deliver imaginative solutions to complex problems.",
        "Key Qualifications": "Bachelor’s degree in Computer Science or related field\n3+ years of relevant industry experience\nOperating distributed systems and delivering internet services at scale\nKnowledge of core internet protocols and technologies such as DNS, TCP/IP, SSL/TLS, HTTP, CDN, etc.\nExperience with monitoring technologies such as Splunk, Grafana, ElasticSearch, Prometheus, etc.\nSkilled in designing, implementing and operating tools and processes to detect, react to and mitigate production issues\nExcellent verbal and written communication skills, with a proven track record of delivering presentations across teams and to senior leadership\nRotating on-call shifts (including periodic weekends)",
        "Salario Mínimo": 143100,
        "Salario Máximo": 264200,
        "Job URL": "https://jobs.apple.com/en-us/details/200569228/quality-of-service-operations-engineer?team=SFTWR"
    },
    {
        "Title": "Software and Services:",
        "Team": "Apps and Frameworks",
        "Job Category": "Software and Services",
        "Job Title": "Senior Analyst - Wallet & Payments - Strategy & Planning",
        "Job Location": "Cupertino, California, United States",
        "Posted Date": "20240920",
        "Role Number": "200569138",
        "Summary": "Do you love thinking analytically? Are you passionate about using your financial knowledge to navigate complex challenges? Just as our customers find value in Apple products, the Finance group finds value for both Apple and its shareholders. As part of this group, you’ll play an integral role in ensuring our day-to-day financial health. You and your team will support Apple’s growth, both top and bottom line, by applying the same level of innovation toward financial matters as we do toward our products and services. You’ll also collaborate with Apple teams across the world to develop more effective investment strategies and risk management. Finance is essential to upholding our global commitment to excellence, and it is directly responsible for shaping the company’s future. Join us, and you’ll have a meaningful role in continuing Apple’s legacy of efficiency and success.\n\nWe’re looking for a Sr Analyst to join the Strategy & Planning team and contribute to our mission of scaling Wallet and Apple Pay into new and exciting markets, establishing organizationally effective practices and removing obstacles. The primary responsibility of this role will be assisting in development of the annual and quarterly operating plans with a focus on budget and headcount resourcing.\n\nThis is a chance to put your own slant on things, show creativity around the financial metrics to track performance and to report to Wallet and Payments leadership team.",
        "Description": "Apple is seeking a highly proficient Financial Analyst to support the Wallet & Payments Strategy organization. This role will be responsible for finance-related activities including managing and forecasting operation expenses requiring a deep understanding of business as well as positive relationships with key partners. Responsibilities include reconciling multiple data universes, identifying discrepancies, managing solutions, supporting other critical deliverables including quarter-end deep-dive analytics. This role will also collaborate cross-functionally across a globally distributed group to meet the data needs of the business and translate those needs into analytical requirements.",
        "Key Qualifications": "6yrs of experience working as a data/business analyst or related role\nProficient with SQL, big data systems and tools and Tableau dashboard design, development and publishing\nBachelor Degree in Business, Finance or related field",
        "Salario Mínimo": 115100,
        "Salario Máximo": 216900,
        "Job URL": "https://jobs.apple.com/en-us/details/200569138/senior-analyst-wallet-payments-strategy-planning?team=SFTWR"
    },
    {
        "Title": "Software and Services:",
        "Team": "Apps and Frameworks",
        "Job Category": "Software and Services",
        "Job Title": "Software Engineer (Swift development), IS&T Enterprise Systems",
        "Job Location": "Austin, Texas, United States",
        "Posted Date": "20240920",
        "Role Number": "200564735",
        "Summary": "Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job, and there's no telling what you could accomplish.\n\nDoes an exciting, multifaceted, fast-paced, and pressure-filled environment catch your attention? Do you like puzzles and resolving solutions that are not obvious? Terrific, we do too! Consider joining us!\n\nJoin Apple’s Customer Systems team within the IS&T organization as a Software Development Engineer. We develop innovative applications that support Apple partners and customers. These applications have contributed to Apple’s #1 position in customer support for the last thirteen years. The ideal candidate should have a good foundation in technology, a proactive mindset, and strong written and verbal communication skills.",
        "Description": "Design, build, deliver, and support software applications and solutions with great user experience and high quality.\n\nImplement and follow best practices in development.\n\nStay on top of the latest and most innovative technologies in the industry.\n\nTake full technical ownership and responsibility for the work you're doing.\n\nPartner with business to ensure their expectations are met and handled.",
        "Key Qualifications": "Working experience in software development of iOS or macOS apps\nKnowledge of Swift programming, including language features, best practices, and performance optimization\nKnowledge and experience developing in iOS or macOS UI frameworks in SwiftUI, UIKit, or AppKit\nProficiency in working with networking and service API integration\nMust be able to communicate technical topics such as software design, root cause analysis, with various targeted audiences",
        "Salario Mínimo": 0,
        "Salario Máximo": 0,
        "Job URL": "https://jobs.apple.com/en-us/details/200564735/software-engineer-swift-development-is-t-enterprise-systems?team=SFTWR"
    },
    {
        "Title": "Software and Services:",
        "Team": "Apps and Frameworks",
        "Job Category": "Software and Services",
        "Job Title": "Senior Cloud Media Library Engineer",
        "Job Location": "Cupertino, California, United States",
        "Posted Date": "20240920",
        "Role Number": "200569055",
        "Summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something.\n\nThis is a great opportunity to be an early member of a new engineering team on a highly visible, highly impactful project! You will be responsible for setting the direction and architecture of new and innovative on-device and cloud-based media management features for the creative space. You will work with human interface designers, quality assurance teams, and cross-functional engineering teams to go beyond code and influence everything from user interfaces to project planning.",
        "Description": "The Creativity Apps team is seeking a highly skilled Senior Engineer with in-depth knowledge and hands-on experience with on-device and cloud-based media management technologies. As a Senior Engineer you will play a key role in designing, implementing, and maintaining robust cloud syncing, media management, efficient on-device storage and collaboration solutions to enhance our products and services.",
        "Key Qualifications": "5+ years proven experience writing and shipping reliable, scalable, maintainable, and testable code\nExperience with Apple platforms including iOS and macOS\nProficient in Swift, Objective-C, C++, or C\nExperience as a technical lead; demonstrating strong communication, collaboration, and project management skills with the ability to articulate technical concepts to both technical and non-technical stakeholders\nProven expertise and deep understanding of cloud syncing, media management, and collaboration technologies\nSolid grasp of computer science fundamentals and object-oriented design\nAbility to write performant, scalable, maintainable, and correct multi-threaded code\nAbility to work effectively in a fast-paced environment and manage multiple priorities\nWillingness to ask for help, learn from others, and mentor others in turn\nCommitted to encouraging an open and inclusive work environment\nBachelor’s Degree in Computer Science or equivalent experience.",
        "Salario Mínimo": 175800,
        "Salario Máximo": 312200,
        "Job URL": "https://jobs.apple.com/en-us/details/200569055/senior-cloud-media-library-engineer?team=SFTWR"
    },
    {
        "Title": "Software and Services:",
        "Team": "Apps and Frameworks",
        "Job Category": "Software and Services",
        "Job Title": "Sr. Engineering Leader, Apple Services Engineering",
        "Job Location": "Cupertino, California, United States",
        "Posted Date": "20240920",
        "Role Number": "200567780",
        "Summary": "Imagine what you can do here!  At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly! Bring passion and dedication to your job and there’s no telling what you can accomplish. \n\nThe people who work at Apple have reinvented and defined entire industries with the Mac, iPhone, iPad, Apple TV, Apple Watch, AirPods, HomePod and Vision Pro. We have done the same with Services, including with iTunes, the App Store, Apple Music, Apple TV+ and Apple Pay. The same passion for innovation that goes into our products also applies to our practices — strengthening our commitment to leave the world better than we found it.\n\nThe Apple Services Engineering (ASE) organization is seeking a seasoned Engineering Leader to oversee a distributed and well-respected engineering team that is driving Rights and Pricing engineering for Apple Services. We’re looking for an exceptional leader with a proven track record of managing complex technical and business initiatives under demanding timelines. \n\nThis precision team builds the systems that power all of the economics behind the App Store, Apple Music, TV/TV+, Podcast, Apple Books, Fitness+, and much more; ensuring that artists, creators, developers, rights-holders, and governments are sharing in the monetization of Apple Services’ ecosystem.",
        "Description": "You will be responsible for the underlying systems that manage digital contracts and provider set up; compute availability over hundreds of millions of products in 175+ territories on multiple platforms; perform retail/wholesale/tax calculations at scale; and ensure compliance with laws worldwide. As a hands-on engineering leader, you will personally drive features as well as provide overall software architecture direction for the platform.\n\nYou will engage with Product, Business, Legal, Operations, and Engineering leadership and cross-functional peers to develop and support new features for Apple customers & content providers. Your team will invest in the modernization of the platform and build world-class tooling to manage the complexity and continue to scale the platform to support the subscription economics across multiple lines of business.\n\nYou will drive a culture of quality and precision, making platform investments that help the team scale the output and anticipate the needs of businesses. You will represent engineering in cross-functional meetings and collaborate on roadmap planning to decide the optimal order of execution for multiple stakeholders and react to changes across the portfolio. \n\nYou take responsibility; you feel a personal stake in the product you ship; you communicate how things work; you thrive in uncertainty and strive to bring order to it; you have deep wisdom and judgement; you keep your eye on the ball; you build strong relationships; you are aware of politics but do not get mired in them; you are constantly looking to improve yourself and those on the teams around you.",
        "Key Qualifications": "12+ years management experience in software engineering, ideally in the field of rights & pricing and content availability systems, and have established expertise in leading a multi-level engineering organization.\nProven track record of managing a vast portfolio of complex technical projects across multiple stakeholders with tight delivery timelines.\nSuperior communication and presentation skills. Must be able to distill and present information in a clear & concise manner at all technical levels and across all business functions.\nSkilled negotiator, able to identify the correct trade-offs and compromise across scope, time, and resources. Experience creating effective change management processes to keep project delivery on track.\nDeep experiences working cross functionally in highly matrixed organizations, establishing strong trusting partnerships with colleagues who may have very different goals than you do to drive success.\nStrong understanding of data modeling and data stores, including relational and key-value at large scale. Strong understanding of API design, service-oriented-architecture, large scale distributed systems and asynchronous patterns with data guarantees.\nExperience building SOX-compliant systems and internal tools; familiarity with building auditable systems and change-histories.",
        "Salario Mínimo": 252400,
        "Salario Máximo": 378700,
        "Job URL": "https://jobs.apple.com/en-us/details/200567780/sr-engineering-leader-apple-services-engineering?team=SFTWR"
    },
    {
        "Title": "Software and Services:",
        "Team": "Apps and Frameworks",
        "Job Category": "Software and Services",
        "Job Title": "Software Engineer (Swift Development), Retail Engineering",
        "Job Location": "Austin, Texas, United States",
        "Posted Date": "20240919",
        "Role Number": "200565117",
        "Summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work! Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something.\n\nAre you deeply accountable for your work? Your real passion for product ownership and track record of product development will prove critical to your success on our team! \n\nRetail Store Apps team is looking for a self-starting and hardworking iOS software engineer to join our team. Dynamic, smart people and inspiring, innovative technologies are the norm here. Are you ready to set the bar high? Dynamic people and inspiring, innovative technologies are the norm here. Will you join us in crafting solutions that do not yet exist?",
        "Description": "Be ready to make something great when you come here. Dynamic, inspiring people and innovative, industry-defining technologies are the norm at Apple. The people who\n\nwork here have reinvented and defined entire industries with our products and\n\nservices. The same passion for innovation also applies to our business practices - strengthening our commitment to leave the world better than we found it.\n\nYou should join the Apple Retail Store Apps Engineering team if you want to help deliver the next amazing Apple product. Retail Store Apps Engineering team is looking creative iOS software engineer to join our team. The team is responsible for delivering quality iOS services and applications for internal and external use. We seek an accomplished Swift developer capable of delivering an outstanding iOS and MacOS user experience to our internal customers.\n\nExceptional problem solving and design skills are must-have components of this\n\nposition. You will play a direct role in conception, design, programming, maintenance, support, documentation and administration of software solutions. You will join a hands-on development team that cultivates creativity and generates novel solutions to deliver engineering perfection.",
        "Key Qualifications": "2 years proven iOS or MacOS app development experience\n2 years experience with using iOS features to ensure app security on the device\n2 years proficiency in Swift/Objective C\n2 years proficiency in any scripting language",
        "Salario Mínimo": 0,
        "Salario Máximo": 0,
        "Job URL": "https://jobs.apple.com/en-us/details/200565117/software-engineer-swift-development-retail-engineering?team=SFTWR"
    },
    {
        "Title": "Software and Services:",
        "Team": "Apps and Frameworks",
        "Job Category": "Software and Services",
        "Job Title": "Software Data Engineer - Analytical Engineering - Apple Media Products",
        "Job Location": "Seattle, Washington, United States",
        "Posted Date": "20240919",
        "Role Number": "200569024",
        "Summary": "Apple's App Store is the world's largest and most innovative app marketplace, home to over 1.5 million apps and serving more than half a billion customers every week across all the Apple devices. Since the App Store launched in 2008, it has changed how we all live; it has enabled countless new companies, spawned new industries, and built millions of jobs. But we believe we are just getting started. We're seeking a software data engineer to join the App Store Data Engineering team. In this role you will help deliver this experience and improve the store every day for both users and developers by generating insights from data in a privacy-friendly manner. We enable data-driven innovation by building solutions, services, and analytical workloads for a variety of internal collaborators and external partners. In a world where apps have become essential in people's daily lives, the App Store team has become essential to Apple's business.",
        "Description": "As a member of the App Store Data Engineering team, you will have significant responsibility and influence in shaping its strategic direction. This is a software engineering position. We write robust code, not just ad-hoc scripts. Our software process dozens of terabytes of data on daily basis. Our volumes are on a petabytes scale. Our jobs and applications must be efficient, scalable, and stable. Although we write software, data is our main product and first-class citizen. We care about accurate and qualitative data as much as we care about fine, clean, and manageable code. The data we produce power Apple leadership and partners about new innovations and the next big things. To succeed here you'll need to be a proponent of building world-class analytical solutions. To be a part of the team means we will want your ideas, concerns, and opinions in our discussions. We are highly collaborative. To join us in our next industry-leading software project you will be expected to be part of our very impactful multi-functional team. Thanks to Apple's unique integration of hardware, software, and services, engineers here partner to get behind a single unified vision. That vision always includes a deep commitment to strengthening Apple's privacy policy, one of Apple's core values. Although services are a bigger part of Apple's business than ever before, these teams remain small, forward-thinking, and multi-functional, offering greater exposure to the array of opportunities here.",
        "Key Qualifications": "Bachelor’s Degree or equivalent experience in Computer Science or related field",
        "Salario Mínimo": 166600,
        "Salario Máximo": 296300,
        "Job URL": "https://jobs.apple.com/en-us/details/200569024/software-data-engineer-analytical-engineering-apple-media-products?team=SFTWR"
    },
    {
        "Title": "Software and Services:",
        "Team": "Apps and Frameworks",
        "Job Category": "Software and Services",
        "Job Title": "Manager, Technical Product Management for Partner Onboarding and Payment Consolidation Systems",
        "Job Location": "New York City, New York, United States",
        "Posted Date": "20240919",
        "Role Number": "200560538",
        "Summary": "Imagine what you can do here! At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly! Bring passion and dedication to your job and there’s no telling what you can accomplish. You will get an opportunity to work on a broad spectrum of opportunities from long-term strategic projects for Apple to near term business initiatives. Our partners are vital to our success and include developers, music labels, video studios, publishers, podcasters and more. You will collaborate with cross-functional teams on marquise new features and product launches for our services, including the App Store, Arcade, Apple Music, TV+, News+, Fitness+, iTunes Stores, Books, Podcasts and more.\n\nWe are looking for an exceptional individual with a proven track record of managing complex technical and business projects under demanding timelines to join our team. In addition to having mastered the fundamental, you need more to succeed in this role. You take ownership; you feel a personal stake in the product you ship; you communicate how things work; you thrive in uncertainty and strive to bring order to it; you have deep wisdom and judgement; you keep your eye on the ball; you build positive relationships; you are aware of politics but do not get mired in them; you are constantly looking to improve yourself and those on the teams around you.",
        "Description": "The Technical Product Management team plays a crucial role to provide thousands of developers and content partners with the tools and features they need to sign contracts, provide tax and banking information, and access payments and financial reports.\n\nYou will play a pivotal role in crafting and driving the engineering for partner on-boarding functions that include digital agreements, banking setup, tax forms, as well as partner payment features that includes reporting, foreign exchange and payments. This is a hands-on position where you will be involved with scheduling and roadmap planning, requirements analysis, functional and technical design discussions, testing, proof-of-concept, working with partners, and more. This role requires working closely, with global and cross-functional teams such as Engineering, QA, Product, IS&T, Business Operations, Digital Supply Chain, Business, Marketing, Legal and Finance.\n\nCome and lead a team of individuals and ensure detailed high-quality work in designing and translating business goals into technical specification requirements used during design, development, and quality assurance. Serve as the main point of contact for all things related to agreements, partner onboarding, and payment consolidation systems. This includes driving technical enhancements, roadmap definition, project prioritization, and new request assessments. Work closely with engineering and program managers to develop and launch features on time and at scale. Since you will be responsible for each project’s success, you are comfortable working within the details and developing expertise in the space, clearly articulating the strategy, requirements, and rationale in leadership and cross-functional reviews. \n\nDoes this sound like you? Join us!",
        "Key Qualifications": "4+ years of recent people management experience\n7+ years of proven experience in product management, consulting, design or engineering\nExperience as an app developer or roles working with developers a plus",
        "Salario Mínimo": 173100,
        "Salario Máximo": 301400,
        "Job URL": "https://jobs.apple.com/en-us/details/200560538/manager-technical-product-management-for-partner-onboarding-and-payment-consolidation-systems?team=SFTWR"
    },
    {
        "Title": "Software and Services:",
        "Team": "Apps and Frameworks",
        "Job Category": "Software and Services",
        "Job Title": "Software QA Engineer, Photography & Videography Post Production",
        "Job Location": "Cupertino, California, United States",
        "Posted Date": "20240919",
        "Role Number": "200568408",
        "Summary": "Apple is where individual imaginations gather together, committing to the values that lead to great work. Every new product we build, service we create, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that inspires the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something.\n\nThe Video Applications QA team is seeking a Software QA Engineer to help test our video applications on macOS and iOS software, ensuring a high-quality customer experience. We need someone who is comfortable working in an exciting environment with constantly evolving priorities, and someone creative and inspired to invent new ways to help build better products.",
        "Description": "We are seeking self-motivated individual with strong technical, problem solving and communication skills, and the willingness to work in a dynamic environment. \n\nResponsible for planning, designing, maintaining and executing test cases with minimal direction. \nAble to test manually and with automation.\nReport bugs with outstanding isolation and regression techniques. \nBalance a wide variety of deliverables that will require the ability to effectively manage priorities and communicate progress and risks systematically. \nYou should be comfortable with ambiguity and with making educated, critical judgments in the absence of complete requirements.\n\nYour ongoing curiosity and dedication to self-education in video and photo technologies as well as new testing techniques is what will set you apart. You should have a proven ability to ramp up quickly on both existing and new technologies. You will be in continual dialogue with Engineering and Design as products evolve and you will need to have compassion for users so you can effectively advocate on their behalf.",
        "Key Qualifications": "Mandatory photography and videography post-production experience.\nMandatory iOS and macOS testing experience.\nBachelors Degree in Computer Science, Engineering, or related work experience.\nAt least 5 years experience as a Software QA Engineer.\nUnderstanding of SDLC and SQA methodologies and practices such as planning, requirements analysis, testing and deployment.\nInquisitive and able to investigate and debug difficult software issues.",
        "Salario Mínimo": 140700,
        "Salario Máximo": 280200,
        "Job URL": "https://jobs.apple.com/en-us/details/200568408/software-qa-engineer-photography-videography-post-production?team=SFTWR"
    },
    {
        "Title": "Software and Services:",
        "Team": "Apps and Frameworks",
        "Job Category": "Software and Services",
        "Job Title": "Safari Core Technologies Security Engineer",
        "Job Location": "Cupertino, California, United States",
        "Posted Date": "20240919",
        "Role Number": "200566819",
        "Summary": "We're looking for an engineer to help us build the most secure and usable web browser. The team builds on the industry-leading WebKit engine and Apple's frameworks to deliver a fluid browsing experience and powerful, easy-to-use features, all while keeping our user and their data safe and private. Your impact will extend beyond Safari, as you help drive the iOS and macOS platforms forward!",
        "Description": "In this role, you'll implement new features that help users be and feel safe while browsing the web, improve the security and privacy of existing features, and take bold steps to eradicate whole classes of security issues. You’ll be involved from beginning to end — brainstorming, prototyping, coding, debugging, shipping, and addressing customer feedback. You will collaborate with industry leading experts in fuzz testing, cryptography, web security, operating system security, user privacy, and design. In this role, we want you to be imaginative and self-motivated, and care deeply about craftsmanship and quality.",
        "Key Qualifications": "Ability to thrive in a highly collaborative environment focused on learning\nExcellent communication skills\nStrong object-oriented programming experience\nThorough understanding of a manual memory managed and pointer-based language such as C, C++, or Objective-C.\nAbility to diagnose security, performance, memory, and other issues",
        "Salario Mínimo": 143100,
        "Salario Máximo": 264200,
        "Job URL": "https://jobs.apple.com/en-us/details/200566819/safari-core-technologies-security-engineer?team=SFTWR"
    },
    {
        "Title": "Software and Services:",
        "Team": "Apps and Frameworks",
        "Job Category": "Software and Services",
        "Job Title": "Test Automation Engineer",
        "Job Location": "San Diego, California, United States",
        "Posted Date": "20240919",
        "Role Number": "200566471",
        "Summary": "Networking group develops control plane and data plane Networking stacks for Apple’s innovative including iPhone, iPad, Apple TV, iPod, and Mac OS. Leveraging adaptive machine learning techniques this group continuously improves the user’s Network connectivity experience.",
        "Description": "Networking group is looking for a passionate software quality engineer to join our group to develop and automate tests and work on performance characterization tests. We are looking for a highly motivated engineer who has the skills to debug complex and layered software stacks. You will be self-motivated and will design and develop analysis and visualization software tools to improvise screening process efficiency. You will collaborate with multiple teams thrive in a dynamic and innovative environment.",
        "Key Qualifications": "BS/MS IN Computer Science or equivalent.\nStrong programming skills with Python, C/C++\nYou will have experience developing scripts and tools\nYou have an ability to work with multi-functional engineering teams",
        "Salario Mínimo": 135400,
        "Salario Máximo": 250600,
        "Job URL": "https://jobs.apple.com/en-us/details/200566471/test-automation-engineer?team=SFTWR"
    },
    {
        "Title": "Software and Services:",
        "Team": "Apps and Frameworks",
        "Job Category": "Software and Services",
        "Job Title": "Sr Messages Services and Security Engineer",
        "Job Location": "Seattle, Washington, United States",
        "Posted Date": "20240919",
        "Role Number": "200566803",
        "Summary": "Join Apple’s Messages Services and Security team as an engineer responsible for designing and ensuring the robustness of Messages’ core delivery and security features. Our team is dedicated to creating exceptional user experiences, as Messages is a crucial platform for secure global connections. Work on building features like Sticker Tapbacks, Send Later, sending Apple Cash through iMessage, Satellite messaging to bring rich experiences to off-grid communication, and working on carrier services like RCS. You will have the opportunity to work closely with partner teams in Telephony, IdentityServices, iCloud, Wallet, image and video codec teams, and many more. You’ll also have the opportunity to be at the forefront of Messages security, working on BlastDoor—a technology that promotes the isolation and sandboxing of untrusted data as it arrives through various Messages services. Come be part of the team helping our customers connect to their most important people in delightful, expressive ways.",
        "Description": "As an engineer on the Messages Services and Security team, your responsibilities will include:\n\n • Designing end-to-end protocols for innovative new Messages features\n • Developing maintainable Swift frameworks, such as BlastDoor, to significantly improve service reliability and security\n • Building infrastructure for safe data handling to prevent against zero-click attacks that don’t require user interaction\n • Creating testable code to rigorously test changes and ensure consistent quality over time\n • Collaborate with cross functional teams to build exciting new user experiences\n • Work on the protocols that build iMessage, Messages via Satellite, Emergency SOS via Satellite, Messages for Business, SMS Relay, and RCS",
        "Key Qualifications": "6+ years experience in the industry\nStrong object-oriented development and design skills\nThe ability to adapt quickly to new technical environments\nA passion for modular, maintainable, testable code\nExperience with system concepts including multi-threaded processing, synchronization, and interprocess communication\nSwift and/or Obj-C",
        "Salario Mínimo": 166600,
        "Salario Máximo": 296300,
        "Job URL": "https://jobs.apple.com/en-us/details/200566803/sr-messages-services-and-security-engineer?team=SFTWR"
    },
    {
        "Title": "Software and Services:",
        "Team": "Apps and Frameworks",
        "Job Category": "Software and Services",
        "Job Title": "Software Engineer (Pricing), Apple Services Engineering",
        "Job Location": "Seattle, Washington, United States",
        "Posted Date": "20240919",
        "Role Number": "200568208",
        "Summary": "The Apple Service Engineering (ASE) Pricing Subscriptions & Infrastructure team is looking for an extraordinary engineer to design and build the best of breed systems for taking care of our complex and ever-growing business requirements, data and infrastructure needs. We are a key part of the Apple ecosystem, supporting millions of pieces of content in the catalog for billions of transactions. \n\nWe're looking for an experienced, enthusiastic developer ready to work at huge scale and have a hand in bringing amazing new products and services to market.",
        "Description": "The Pricing team supports millions of pieces of content in more than 150 markets enjoyed by hundreds of millions of users, which powers various features within the Apple ecosystem - iCloud, App Store, Apple Music, Apple TV+, iTunes, iBooks, Podcast, etc. We've got unique and growing needs for managing pricing and availability for the catalog across various lines of business. This is an exciting and global reaching team!\n\nIn this role, you’ll be responsible for building new features, services, data models, APIs, user workflows and infrastructure for pricing and availability platform. You will collaborate with a team of dedicated engineers, program managers, and product managers to deliver software solutions that push the boundaries of what is possible. \n\nWe are hiring a self-starter who is daring and willing to question assumptions. Excellent written and oral communication skills are required. You should have experience developing large-scale, server-side systems using Java. We are looking for a teammate who wants to tackle problems under deadlines and deliver visionary solutions. We value your thoughts on how we can move faster, be more creative, and deliver tools and ideas to empower developers around the world. We expect you to challenge the status quo, care about the details, the end user, and how it all comes together. \n\nDoes this sound like you? Join our team!",
        "Key Qualifications": "Extensive experience with Java\nOver 5 years of experience in designing, implementing, and supporting highly scalable backend applications\nExperience crafting and implementing RESTful/RPC API and services.\nSignificant experience with SQL databases like Oracle and NoSQL like Cassandra.\nStrong production, debugging, and performance tuning experiences and skills.\nExperience working on complex problems and distributed systems where scalability and performance are extremely important (every millisecond counts)\nAbility to adapt to and contribute to the team best practices in coding patterns & standards across multiple code repositories, unit testing and continuous deployment\nShould be independent and able to effectively work with cross functional teams",
        "Salario Mínimo": 135400,
        "Salario Máximo": 250600,
        "Job URL": "https://jobs.apple.com/en-us/details/200568208/software-engineer-pricing-apple-services-engineering?team=SFTWR"
    },
    {
        "Title": "Software and Services:",
        "Team": "Apps and Frameworks",
        "Job Category": "Software and Services",
        "Job Title": "Messages Services and Security Engineer",
        "Job Location": "Seattle, Washington, United States",
        "Posted Date": "20240919",
        "Role Number": "200566802",
        "Summary": "Join Apple’s Messages Services and Security team as an engineer responsible for designing and ensuring the robustness of Messages’ core delivery and security features. Our team is dedicated to creating exceptional user experiences, as Messages is a crucial platform for secure global connections. Work on building features like Sticker Tapbacks, Send Later, sending Apple Cash through iMessage, Satellite messaging to bring rich experiences to off-grid communication, and working on carrier services like RCS. You will have the opportunity to work closely with partner teams in Telephony, IdentityServices, iCloud, Wallet, image and video codec teams, and many more. You’ll also have the opportunity to be at the forefront of Messages security, working on BlastDoor—a technology that promotes the isolation and sandboxing of untrusted data as it arrives through various Messages services. Come be part of the team helping our customers connect to their most important people in delightful, expressive ways.",
        "Description": "As an engineer on the Messages Services and Security team, your responsibilities will include:\n\n • Designing end-to-end protocols for innovative new Messages features\n • Developing maintainable Swift frameworks, such as BlastDoor, to significantly improve service reliability and security\n • Building infrastructure for safe data handling to prevent against zero-click attacks that don’t require user interaction\n • Creating testable code to rigorously test changes and ensure consistent quality over time\n • Collaborate with cross functional teams to build exciting new user experiences\n • Work on the protocols that build iMessage, Messages via Satellite, Emergency SOS via Satellite, Messages for Business, SMS Relay, and RCS",
        "Key Qualifications": "Strong object-oriented development and design skills\nThe ability to adapt quickly to new technical environments\nA passion for modular, maintainable, testable code",
        "Salario Mínimo": 115731,
        "Salario Máximo": 204000,
        "Job URL": "https://jobs.apple.com/en-us/details/200566802/messages-services-and-security-engineer?team=SFTWR"
    },
    {
        "Title": "Software and Services:",
        "Team": "Apps and Frameworks",
        "Job Category": "Software and Services",
        "Job Title": "Software Engineer, Messages Platform",
        "Job Location": "Cupertino, California, United States",
        "Posted Date": "20240919",
        "Role Number": "200567769",
        "Summary": "The Messages team is looking for a software engineer passionate about personal\ncommunication. You’ll be part of the team of engineers focused on APIs and frameworks for\nother teams at Apple to build on top of and integrate UI into Messages including iMessage\napps, Stickers, and Shared with You. You’ll work closely with partner teams on features like\nMemoji, Apple Cash, #images, Camera Effects, Siri, and much more. The Messages Platform\nincludes defining public API for building on top of the Messages and adding to its rich\nexperience. Come be part of the team helping our customers connect to their most important\npeople in delightful, expressive ways.",
        "Description": "Every day, millions of people connect via Messages, expressing and sharing with the people\nwho matter most to them in many different ways. We are constantly adding new\ncommunication tools for iMessage, all with end-to-end encryption for both individual and group\nconversations. As an engineer on the Messages Platform team, you’ll use the right tool for the\njob, from Objective-C to Swift, UIKit and even SwiftUI. You will play a large role in adopting and\ndefining new system APIs before they’re publicly announced. Successful engineers will be\nprepared to work from the UI down to the local database and protocol layers, working with\nengineers across teams to deliver complex features on time. Join us and bring expressivity, joy,\nand security to conversations around the world.",
        "Key Qualifications": "You possess strong software development and design skills.\nYou have strong object-oriented programming skills in at least one language likeObjective-C and Swift.\nYou have strong communication, collaboration, and interpersonal skills.\nYou are self-directed and can solve problems independently.",
        "Salario Mínimo": 143100,
        "Salario Máximo": 264200,
        "Job URL": "https://jobs.apple.com/en-us/details/200567769/software-engineer-messages-platform?team=SFTWR"
    },
    {
        "Title": "Software and Services:",
        "Team": "Apps and Frameworks",
        "Job Category": "Software and Services",
        "Job Title": "Software Engineer, App Intents and Shortcuts",
        "Job Location": "Cupertino, California, United States",
        "Posted Date": "20240919",
        "Role Number": "200568832",
        "Summary": "Work on the core technologies that are changing the way we interact with our devices and underlie the Apple Intelligence ecosystem. Build the frameworks and experiences that turn Apple’s devices into true bicycles for the mind: technology that empowers people to express themselves and get more done while integrating seamlessly into their lives. The App Intents and Shortcuts team at Apple is looking for engineers with experience working on Apple’s platforms and a passion for crafting elegant APIs and user experiences for the next generation of Apple software and hardware. In this role you’ll be part of a multi-functional and collaborative team that works on the App Intents framework, as well as the infrastructure and UX behind the new Siri assistant, widgets, automations, focus filters, the action button, and much more. You'll ship code that runs on the devices you use every day, unlocks the creativity of developers around the world, and powers products that are critical to the lives of millions of users!",
        "Description": "As a strong programmer and a creative problem solver, you can break down interesting technical challenges and create elegant, robust, scalable code. You care deeply about software architecture and writing code that is flexible and maintainable in the future. You are excited about developing new APIs and core capabilities that power the latest from Apple, as well as maintaining existing code, fixing bugs, and giving your work that extra little bit of polish. You finish your work with a keen eye for the details that surprise and delight customers, including end-users and developers. You’re excited about owning foundational tools that developers both within and outside of Apple will use to ship things you couldn’t even imagine. \n\nIn this role, you will primarily be responsible for designing and developing new features and APIs within the App Intents framework. There will also be opportunities to work on the Shortcuts app and underlying frameworks and infrastructure, as well as other system-wide UIs and experiences that are deeply integrated with App Intents, including the Siri assistant, Widgets, and much more. You will work across teams and organizations, building relationships and crafting compelling features and APIs. This includes both first-party Apple teams adopting our work and teams working below us in the stack on the Swift compiler and Xcode developer tools. You will guide APIs through an iterative review process alongside experts from our partner teams and across Apple, finally presenting them to developers at WWDC!",
        "Key Qualifications": "4+ years of experience developing software and applications in Objective-C or Swift\nFamiliarity with essential software development tools (Xcode, lldb, Instruments, git)\nExperience designing clean, well-abstracted interfaces between software components or libraries\nB.S. or equivalent experience in Computer Science or a related field, or equivalent practical experience.",
        "Salario Mínimo": 175800,
        "Salario Máximo": 312200,
        "Job URL": "https://jobs.apple.com/en-us/details/200568832/software-engineer-app-intents-and-shortcuts?team=SFTWR"
    }
]